# 遗传算法
import numpy as np

prob_cross = 0.9  # 交叉概率
prob_mutate = 0.05  # 变异概率
prob_select = 0.1  # 选择最优个体的概率

# 公共区域
max_iter = 100
GAK = 20  # K-邻域搜索范围

# 模拟退火算法
template_initial = 1000
decrease = 0.6
template_end = 1e-3
MAXCOUNT = 1000  # TWOPT的最大次数

# 粒子群算法
li_num = 50

test14 = np.array(
    [[16.47, 96.10], [16.47, 94.44], [20.09, 92.54], [22.39, 93.37], [25.23, 97.24], [22.00, 96.05], [20.47, 97.02],
     [17.20, 96.29], [16.30, 97.38], [14.05, 98.12], [16.53, 97.38], [21.52, 95.59], [19.41, 97.13], [20.09, 92.55]])
